# CannotCutRefPlane Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CannotCutRefPlane Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Can't cut reference plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCutRefPlane { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCutRefPlane As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCutRefPlane {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace